**FREE
dcl-s NAME CHAR(20) INZ('PRIYANSHU');
DCL-S COURSE CHAR(20) INZ('RPGLE');
DCL-S RESULT CHAR(50);
RESULT = %TRIM(NAME) + ' ' + %TRIM(COURSE);
DSPLY RESULT;
*INLR = *ON;
RETURN;
